{
  "char_to_idx": {
    " ": 1,
    "!": 2,
    "\"": 3,
    "#": 4,
    "&": 5,
    "'": 6,
    "(": 7,
    ")": 8,
    ",": 9,
    "-": 10,
    ".": 11,
    "/": 12,
    "0": 13,
    "1": 14,
    "2": 15,
    "3": 16,
    "4": 17,
    "5": 18,
    "6": 19,
    "7": 20,
    "8": 21,
    "9": 22,
    ":": 23,
    ";": 24,
    "=": 25,
    ">": 26,
    "?": 27,
    "@": 28,
    "A": 29,
    "B": 30,
    "C": 31,
    "D": 32,
    "E": 33,
    "F": 34,
    "G": 35,
    "H": 36,
    "I": 37,
    "K": 38,
    "L": 39,
    "M": 40,
    "N": 41,
    "O": 42,
    "P": 43,
    "Q": 44,
    "R": 45,
    "S": 46,
    "T": 47,
    "U": 48,
    "V": 49,
    "W": 50,
    "Y": 51,
    "Z": 52,
    "_": 53,
    "a": 54,
    "b": 55,
    "c": 56,
    "d": 57,
    "e": 58,
    "f": 59,
    "g": 60,
    "h": 61,
    "i": 62,
    "j": 63,
    "k": 64,
    "l": 65,
    "m": 66,
    "n": 67,
    "o": 68,
    "p": 69,
    "q": 70,
    "r": 71,
    "s": 72,
    "t": 73,
    "u": 74,
    "v": 75,
    "w": 76,
    "x": 77,
    "y": 78,
    "z": 79,
    "{": 80,
    "}": 81,
    "~": 82,
    "ក": 83,
    "ខ": 84,
    "គ": 85,
    "ឃ": 86,
    "ង": 87,
    "ច": 88,
    "ឆ": 89,
    "ជ": 90,
    "ឈ": 91,
    "ញ": 92,
    "ដ": 93,
    "ឋ": 94,
    "ឌ": 95,
    "ឍ": 96,
    "ណ": 97,
    "ត": 98,
    "ថ": 99,
    "ទ": 100,
    "ធ": 101,
    "ន": 102,
    "ប": 103,
    "ផ": 104,
    "ព": 105,
    "ភ": 106,
    "ម": 107,
    "យ": 108,
    "រ": 109,
    "ល": 110,
    "វ": 111,
    "ស": 112,
    "ហ": 113,
    "ឡ": 114,
    "អ": 115,
    "ឥ": 116,
    "ឦ": 117,
    "ឧ": 118,
    "ឩ": 119,
    "ឪ": 120,
    "ឫ": 121,
    "ឬ": 122,
    "ឭ": 123,
    "ឮ": 124,
    "ឯ": 125,
    "ឰ": 126,
    "ឱ": 127,
    "ឲ": 128,
    "ឳ": 129,
    "ា": 130,
    "ិ": 131,
    "ី": 132,
    "ឹ": 133,
    "ឺ": 134,
    "ុ": 135,
    "ូ": 136,
    "ួ": 137,
    "ើ": 138,
    "ឿ": 139,
    "ៀ": 140,
    "េ": 141,
    "ែ": 142,
    "ៃ": 143,
    "ោ": 144,
    "ៅ": 145,
    "ំ": 146,
    "ះ": 147,
    "ៈ": 148,
    "៉": 149,
    "៊": 150,
    "់": 151,
    "៌": 152,
    "៍": 153,
    "៏": 154,
    "័": 155,
    "្": 156,
    "។": 157,
    "៕": 158,
    "ៗ": 159,
    "៘": 160,
    "០": 161,
    "១": 162,
    "២": 163,
    "៣": 164,
    "៤": 165,
    "៥": 166,
    "៦": 167,
    "៧": 168,
    "៨": 169,
    "៩": 170,
    "​": 171,
    "<BLANK>": 0
  },
  "idx_to_char": {
    "1": " ",
    "2": "!",
    "3": "\"",
    "4": "#",
    "5": "&",
    "6": "'",
    "7": "(",
    "8": ")",
    "9": ",",
    "10": "-",
    "11": ".",
    "12": "/",
    "13": "0",
    "14": "1",
    "15": "2",
    "16": "3",
    "17": "4",
    "18": "5",
    "19": "6",
    "20": "7",
    "21": "8",
    "22": "9",
    "23": ":",
    "24": ";",
    "25": "=",
    "26": ">",
    "27": "?",
    "28": "@",
    "29": "A",
    "30": "B",
    "31": "C",
    "32": "D",
    "33": "E",
    "34": "F",
    "35": "G",
    "36": "H",
    "37": "I",
    "38": "K",
    "39": "L",
    "40": "M",
    "41": "N",
    "42": "O",
    "43": "P",
    "44": "Q",
    "45": "R",
    "46": "S",
    "47": "T",
    "48": "U",
    "49": "V",
    "50": "W",
    "51": "Y",
    "52": "Z",
    "53": "_",
    "54": "a",
    "55": "b",
    "56": "c",
    "57": "d",
    "58": "e",
    "59": "f",
    "60": "g",
    "61": "h",
    "62": "i",
    "63": "j",
    "64": "k",
    "65": "l",
    "66": "m",
    "67": "n",
    "68": "o",
    "69": "p",
    "70": "q",
    "71": "r",
    "72": "s",
    "73": "t",
    "74": "u",
    "75": "v",
    "76": "w",
    "77": "x",
    "78": "y",
    "79": "z",
    "80": "{",
    "81": "}",
    "82": "~",
    "83": "ក",
    "84": "ខ",
    "85": "គ",
    "86": "ឃ",
    "87": "ង",
    "88": "ច",
    "89": "ឆ",
    "90": "ជ",
    "91": "ឈ",
    "92": "ញ",
    "93": "ដ",
    "94": "ឋ",
    "95": "ឌ",
    "96": "ឍ",
    "97": "ណ",
    "98": "ត",
    "99": "ថ",
    "100": "ទ",
    "101": "ធ",
    "102": "ន",
    "103": "ប",
    "104": "ផ",
    "105": "ព",
    "106": "ភ",
    "107": "ម",
    "108": "យ",
    "109": "រ",
    "110": "ល",
    "111": "វ",
    "112": "ស",
    "113": "ហ",
    "114": "ឡ",
    "115": "អ",
    "116": "ឥ",
    "117": "ឦ",
    "118": "ឧ",
    "119": "ឩ",
    "120": "ឪ",
    "121": "ឫ",
    "122": "ឬ",
    "123": "ឭ",
    "124": "ឮ",
    "125": "ឯ",
    "126": "ឰ",
    "127": "ឱ",
    "128": "ឲ",
    "129": "ឳ",
    "130": "ា",
    "131": "ិ",
    "132": "ី",
    "133": "ឹ",
    "134": "ឺ",
    "135": "ុ",
    "136": "ូ",
    "137": "ួ",
    "138": "ើ",
    "139": "ឿ",
    "140": "ៀ",
    "141": "េ",
    "142": "ែ",
    "143": "ៃ",
    "144": "ោ",
    "145": "ៅ",
    "146": "ំ",
    "147": "ះ",
    "148": "ៈ",
    "149": "៉",
    "150": "៊",
    "151": "់",
    "152": "៌",
    "153": "៍",
    "154": "៏",
    "155": "័",
    "156": "្",
    "157": "។",
    "158": "៕",
    "159": "ៗ",
    "160": "៘",
    "161": "០",
    "162": "១",
    "163": "២",
    "164": "៣",
    "165": "៤",
    "166": "៥",
    "167": "៦",
    "168": "៧",
    "169": "៨",
    "170": "៩",
    "171": "​",
    "0": "<BLANK>"
  },
  "vocab_size": 172,
  "chars": [
    " ",
    "!",
    "\"",
    "#",
    "&",
    "'",
    "(",
    ")",
    ",",
    "-",
    ".",
    "/",
    "0",
    "1",
    "2",
    "3",
    "4",
    "5",
    "6",
    "7",
    "8",
    "9",
    ":",
    ";",
    "=",
    ">",
    "?",
    "@",
    "A",
    "B",
    "C",
    "D",
    "E",
    "F",
    "G",
    "H",
    "I",
    "K",
    "L",
    "M",
    "N",
    "O",
    "P",
    "Q",
    "R",
    "S",
    "T",
    "U",
    "V",
    "W",
    "Y",
    "Z",
    "_",
    "a",
    "b",
    "c",
    "d",
    "e",
    "f",
    "g",
    "h",
    "i",
    "j",
    "k",
    "l",
    "m",
    "n",
    "o",
    "p",
    "q",
    "r",
    "s",
    "t",
    "u",
    "v",
    "w",
    "x",
    "y",
    "z",
    "{",
    "}",
    "~",
    "ក",
    "ខ",
    "គ",
    "ឃ",
    "ង",
    "ច",
    "ឆ",
    "ជ",
    "ឈ",
    "ញ",
    "ដ",
    "ឋ",
    "ឌ",
    "ឍ",
    "ណ",
    "ត",
    "ថ",
    "ទ",
    "ធ",
    "ន",
    "ប",
    "ផ",
    "ព",
    "ភ",
    "ម",
    "យ",
    "រ",
    "ល",
    "វ",
    "ស",
    "ហ",
    "ឡ",
    "អ",
    "ឥ",
    "ឦ",
    "ឧ",
    "ឩ",
    "ឪ",
    "ឫ",
    "ឬ",
    "ឭ",
    "ឮ",
    "ឯ",
    "ឰ",
    "ឱ",
    "ឲ",
    "ឳ",
    "ា",
    "ិ",
    "ី",
    "ឹ",
    "ឺ",
    "ុ",
    "ូ",
    "ួ",
    "ើ",
    "ឿ",
    "ៀ",
    "េ",
    "ែ",
    "ៃ",
    "ោ",
    "ៅ",
    "ំ",
    "ះ",
    "ៈ",
    "៉",
    "៊",
    "់",
    "៌",
    "៍",
    "៏",
    "័",
    "្",
    "។",
    "៕",
    "ៗ",
    "៘",
    "០",
    "១",
    "២",
    "៣",
    "៤",
    "៥",
    "៦",
    "៧",
    "៨",
    "៩",
    "​"
  ]
}